*** ~:raw-value~ property headline

#+NAME: three-headlines
#+BEGIN_SRC org
  ,* level 1
  ,** level 2
  ,*** level 3
#+END_SRC


#+BEGIN_SRC elisp :results list replace :var data=three-headlines() :exports both 
  (org-element-map
      (with-temp-buffer
        (insert data)
        (org-element-parse-buffer))
      '(headline)
    (lambda (hl) (org-element-property :raw-value hl))
    )
#+END_SRC

#+RESULTS:
- level 1
- level 2
- level 3

**** ~:name~ property value of src block

#+NAME: named-src-blocks
#+BEGIN_SRC org

  ,#+NAME: src-block-a
  ,#+BEGIN_SRC shell
    echo "I'm SRC Block A"
  ,#+END_SRC

  ,#+NAME: src-block-b
  ,#+BEGIN_SRC shell
    echo "I'm SRC Block B"
  ,#+END_SRC

  ,#+NAME: src-block-c
  ,#+BEGIN_SRC shell
    echo "I'm SRC Block C"
  ,#+END_SRC
#+END_SRC


#+BEGIN_SRC elisp :results replace :var data=named-src-blocks() :exports both 
  (org-element-map
      (with-temp-buffer
        (insert data)
        (org-element-parse-buffer))
      '(src-block)
    (lambda (x) (list (org-element-property :name x)))
    )
#+END_SRC

#+RESULTS:
| src-block-a |
| src-block-b |
| src-block-c |


---------


#+BEGIN_SRC elisp :results replace :var data=named-src-blocks() :exports both :var name="src-block-a"
(let ((my-names (org-element-map
      (with-temp-buffer
        (insert data)
        (org-element-parse-buffer))
      '(src-block)
    (lambda (x) (org-element-property :name x))
    )))
(if (member name my-names) name nil))
#+END_SRC

#+RESULTS:
: src-block-a


